import pandas as pd


TEAM_MAPPING = {
    "Цинiчнi бандери": ["Цинічні бандери"],
    "Beit Grand - Аборигени": ["Beit Grand - Аборигены", "Аборигени", "Аборигени+"],
    "Автопілот": ["Автопилот"],
    "Мінус один": ["Минус один", "Мінус Один"],
    "Соснова шишечка": ["Сосновая шишечка", "Соснова Шишечка"],
    "Прозорі Зумери": ["Прозорі Зззумери"],
    "Капітан Джек": ["Капитан Джек", "Captain Jack"],
    "Дракони Ймовірності": ["Drakony Jmovirnosti"],
    "Забобонні бонобо": ["Забобонні Бонобо"],
    "Kéisécker": ["Keisecker"],
    "seꑭes": ["senes", "seꏢes", "Кумівство, корупція та непотизм"],
    "Манія Величі": ["Мания Величия"],
    "Злобні Урук-хай": ["Злобні урукхаї", "Злобные Урук-хай"],
    "Харківська весільна слононіжка": ["Харківська Весільна Слононіжка", "Слононіжка", "весільна слононіжка", "Весільна слононіжка"],
    "Яка вам різниця?": ["Яка Вам Різниця", "Яка Вам Різниця?"],
    "Гря хм гагага": ["гря хм гагага"],
    "В'язні міста ІФ": ["В'язні міста Іф"],
    "Сливки - Форс-Мажор": ["СФМ"],
    "Балабеники": ["28 тисяч вивірок", "Балабеники (28 тисяч вивірок)"],
    "БЗ": ["Б.З."],
    "Команда №2": ["Команда номер 2"],
    "Who knew?": ["Who Knew?"],
    "Де Лореан?": ["Ми з Миколаєва"],
    "Західний полюс": ["Захидный полюс", "Західний Полюс"],
    "Генератор": ["Генератор случайных слов"],
    "Пунктуальність": ["Пунктуальность"],
    "Коментарі Асгарда": ["Комментарии Асгарда"],
    "Каїсса - Дикий Сад": ["Каисса - Дикий сад"],
    "Черкаське FIDO": ["Черкасское FIDO"],
    "Галера надвечір": ["Галена надвечір"],
    "Серьога Хруст і Гідрогарік": ["Серёга Хруст и ГидрогарикTwo ", "Серёга Хруст и Гидрогарик"],
    "Алкобоги": ["Алокбоги"],
    "Lorem City": ["Lorem Ipsum", "Lorem ipsum"],
    "Легіон": ["Андрюша (Легіон)"],
    "ЩДКоти": ["Комети (ЩДКоти)"],
    "Одиночество в SETI": ["Одиночество в SETI (м. Одеса)", "Один у полі воїн"],
} # taken from Yevhen Filatov's code


ratingFil = pd.read_csv("history.csv")
ratingList = ratingFil["Команда"].to_list()
teams15 = ratingList[0:5]
teams610 = ratingList[5:10]
teams1115 = ratingList[10:15]
teams1630 = ratingList[15:30]
teams31plus = ratingList[30:]