tourneyTables = {"Українські турніри/ОТ Зима.xlsx": "Олександрійська трилогія. Зима",
                 "Українські турніри/СинЛУК Зима.xlsx": "Синхрон ЛУК. Зима",
                 "Українські турніри/Зимовий Major.xlsx": "Зимовий Major ЛУК",
                 "Українські турніри/Товстолобик.xlsx": "Товстолобик",
                 "Українські турніри/СинЛУК Весна.xlsx": "Синхрон ЛУК. Весна",
                 "Українські турніри/Minor.xlsx": "Minor ЛУК",
                 "Українські турніри/Simply Green.xlsx": "Simply Green",
                 "Українські турніри/СинЛУК Літо.xlsx": "Синхрон ЛУК. Літо",
                 "Українські турніри/Літній Major.xlsx": "Літній Major ЛУК",
                 "Українські турніри/ССМП 3.xlsx": "Синхрон синів маминої подруги 3",
                 "Українські турніри/Тузік вкусний.xlsx": "Канхвєта очєнь класна. Тузік вкусний",
                 "Українські турніри/Фінал Сезону.xlsx": "Фінал Сезону ЧУ 2024/2025"} # rated tournaments in 2024/25

tourneyTables2 = {"Українські турніри/УкрЛіга 2425 Етап 3.xlsx": "Українська ліга 24/25. Етап 3",
                  "Українські турніри/УкрЛіга 2425 Етап 4.xlsx": "Українська ліга 24/25. Етап 4",
                  "Українські турніри/УкрЛіга 2425 Етап 5.xlsx": "Українська ліга 24/25. Етап 5",
                  "Українські турніри/Дзеркало Кубку Одеси 2025.xlsx": "Дзеркало Відкритого Кубку Одеси 2025",
                  "Українські турніри/Забобони Бонобо 2.xlsx": "Забобони Бонобо 2: Шабаш",
                  "Українські турніри/Борисфен Дарниця.xlsx": "Борисфен 10: Дарниця",
                  "Українські турніри/HDQ Pictures.xlsx": "HDQ. Pictures",
                  "Українські турніри/Бузький Гард 8.xlsx": "Бузький Гард-8"} # unrated tournaments

tourneyTables3 = {} # rated tournaments in 2025/26